
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваНаСчетах Расход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Счет = Счет;
	Движение.Сумма = Сумма;

	// регистр ДвижениеДСПоСтатьям 
	Движения.ДвижениеДСПоСтатьям.Записывать = Истина;
	Движение = Движения.ДвижениеДСПоСтатьям.Добавить();
	Движение.Период = Дата;
	Движение.ФизЛицо = ФизЛицо;
	Движение.Статья = СтатьиДвиженияДС;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
