
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланПокупок") Тогда
		// Заполнение шапки
		СуммаОбщая = ДанныеЗаполнения.СуммаОбщая;
		Для Каждого ТекСтрокаПокупкаПродуктов Из ДанныеЗаполнения.ПокупкаПродуктов Цикл
			НоваяСтрока = ПокупкаПродуктов.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаПокупкаПродуктов.ЕдиницаИзмерения;
			НоваяСтрока.Итого = ТекСтрокаПокупкаПродуктов.Итого;
			НоваяСтрока.Количество = ТекСтрокаПокупкаПродуктов.Количество;
			НоваяСтрока.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
			НоваяСтрока.Цена = ТекСтрокаПокупкаПродуктов.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПотребностьВПродуктах Расход
	Движения.ПотребностьВПродуктах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ПотребностьВПродуктах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
		Движение.Количество = ТекСтрокаПокупкаПродуктов.Количество;
	КонецЦикла;

	// регистр ДенежныеСредстваНаСчетах Расход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Счет = Счет;
		Движение.Сумма = ТекСтрокаПокупкаПродуктов.Итого;
	КонецЦикла;

	// регистр ДвижениеДСПоСтатьям 
	Движения.ДвижениеДСПоСтатьям.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ДвижениеДСПоСтатьям.Добавить();
		Движение.Период = Дата;
		Движение.ФизЛицо = ФизЛицо;
		Движение.Статья = СтатьяДвиженияДС;                                              
		Движение.Сумма = ТекСтрокаПокупкаПродуктов.Итого;
	КонецЦикла;
	
	Если Режим =  РежимПроведенияДокумента.Оперативный Тогда 
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваНаСчетахОстатки.Счет КАК Счет,
		|	ДенежныеСредстваНаСчетахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаСчетах.Остатки(, Счет = &Счет) КАК ДенежныеСредстваНаСчетахОстатки
		|ГДЕ
		|	ДенежныеСредстваНаСчетахОстатки.СуммаОстаток < 0";
		
		Запрос.УстановитьПараметр("Счет", Счет);
	    Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			Отказ = Истина;
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщить("Недостаточно средств на "+ ВыборкаДетальныеЗаписи.Счет);
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
			КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
        КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаОбщая = ПокупкаПродуктов.Итог("Итого");
КонецПроцедуры
