
&НаКлиенте
Процедура ПокупкаПродуктовКоличествоПриИзменении(Элемент)
	 ТекущиеДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	 ТекущиеДанныеПокупкаПродуктов.Итого = ТекущиеДанныеПокупкаПродуктов.Количество *ТекущиеДанныеПокупкаПродуктов.Цена;
	 
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПродуктовЦенаПриИзменении(Элемент)
	 ТекущиеДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	 ТекущиеДанныеПокупкаПродуктов.Итого = ТекущиеДанныеПокупкаПродуктов.Количество *ТекущиеДанныеПокупкаПродуктов.Цена;
	
КонецПроцедуры
