
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваНаСчетах Приход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Счет = СчетПриемник;
	Движение.Сумма = Сумма;

	// регистр ДенежныеСредстваНаСчетах Расход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Счет = СчетИсточник;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
