
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПотребностьВпродуктах Приход
	Движения.ПотребностьВпродуктах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ПотребностьВпродуктах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
		Движение.Количество = ТекСтрокаПокупкаПродуктов.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ПокупкаПродуктов("Итого") = ПокупкаПродуктов("Количество") * ПокупкаПродуктов("Цена");
	
	СуммаОбщая = ПокупкаПродуктов.Итог("Итого");
	
КонецПроцедуры
